Zadanie 2:
Plik test zawiera dane pasażerów Titanica
plik gender_submission zawiera informacje, kto przeżył rejs
1) Do pliku test dodaj columnę survived z informacją, czy dany pasażer przeżył, czy nie
2) Stwórz plik result, w którym będą informacje o:
- ilu było pasażerów
- ile mężczyzn
- średnia wieku pasażerów
- ile osób przeżyło
- ilu mężczyzn przeżyło
- średnia wieku osób, które przeżyły
- jaki procent osób, które mają przyporządkowane kabiny przeżyły
- jaki procent osób, które nia mają przyporządkowanych kolumn przeżyły
to może być np.  w formie każda z informacji jako wiersz (będą dwie kolumny info i result)

In [1]:
import pandas as pd

In [2]:
test = pd.read_csv('test.csv')
gender = pd.read_csv('gender_submission.csv')

In [53]:
#1 Adding survive column
df = pd.merge(left=test, right=gender, on='PassengerId')

In [54]:
df.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [119]:
print(df.head(20))

    PassengerId  Pclass                                               Name  \
0           892       3                                   Kelly, Mr. James
1           893       3                   Wilkes, Mrs. James (Ellen Needs)
2           894       2                          Myles, Mr. Thomas Francis
3           895       3                                   Wirz, Mr. Albert
4           896       3       Hirvonen, Mrs. Alexander (Helga E Lindqvist)
5           897       3                         Svensson, Mr. Johan Cervin
6           898       3                               Connolly, Miss. Kate
7           899       2                       Caldwell, Mr. Albert Francis
8           900       3          Abrahim, Mrs. Joseph (Sophie Halaut Easu)
9           901       3                            Davies, Mr. John Samuel
10          902       3                                   Ilieff, Mr. Ylio
11          903       1                         Jones, Mr. Charles Cresson
12          904       1      Snyder, Mrs. John Pillsbury (Nelle Stevenson)
13          905       2                               Howard, Mr. Benjamin
14          906       1  Chaffee, Mrs. Herbert Fuller (Carrie Constance...
15          907       2      del Carlo, Mrs. Sebastiano (Argenia Genovesi)
16          908       2                                  Keane, Mr. Daniel
17          909       3                                  Assaf, Mr. Gerios
18          910       3                       Ilmakangas, Miss. Ida Livija
19          911       3              Assaf Khalil, Mrs. Mariana (Miriam")"

       Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked  \
0     male  34.5      0      0            330911   7.8292   NaN        Q
1   female  47.0      1      0            363272   7.0000   NaN        S
2     male  62.0      0      0            240276   9.6875   NaN        Q
3     male  27.0      0      0            315154   8.6625   NaN        S
4   female  22.0      1      1           3101298  12.2875   NaN        S
5     male  14.0      0      0              7538   9.2250   NaN        S
6   female  30.0      0      0            330972   7.6292   NaN        Q
7     male  26.0      1      1            248738  29.0000   NaN        S
8   female  18.0      0      0              2657   7.2292   NaN        C
9     male  21.0      2      0         A/4 48871  24.1500   NaN        S
10    male   NaN      0      0            349220   7.8958   NaN        S
11    male  46.0      0      0               694  26.0000   NaN        S
12  female  23.0      1      0             21228  82.2667   B45        S
13    male  63.0      1      0             24065  26.0000   NaN        S
14  female  47.0      1      0       W.E.P. 5734  61.1750   E31        S
15  female  24.0      1      0     SC/PARIS 2167  27.7208   NaN        C
16    male  35.0      0      0            233734  12.3500   NaN        Q
17    male  21.0      0      0              2692   7.2250   NaN        C
18  female  27.0      1      0  STON/O2. 3101270   7.9250   NaN        S
19  female  45.0      0      0              2696   7.2250   NaN        C

    Survived
0          0
1          1
2          0
3          0
4          1
5          0
6          1
7          0
8          1
9          0
10         0
11         0
12         1
13         0
14         1
15         1
16         0
17         0
18         1
19         1

In [22]:
df.shape

(418, 12)

In [23]:
df.describe()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Survived
count,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000,418.000000
mean,1100.500000,2.265550,30.272590,0.447368,0.392344,35.627188,0.363636
std,120.810458,0.841838,14.181209,0.896760,0.981429,55.907576,0.481622
min,892.000000,1.000000,0.170000,0.000000,0.000000,0.000000,0.000000
25%,996.250000,1.000000,21.000000,0.000000,0.000000,7.895800,0.000000
50%,1100.500000,3.000000,27.000000,0.000000,0.000000,14.454200,0.000000
75%,1204.750000,3.000000,39.000000,1.000000,0.000000,31.500000,1.000000
max,1309.000000,3.000000,76.000000,8.000000,9.000000,512.329200,1.000000

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 0 to 417
Data columns (total 12 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
Survived       418 non-null int64
dtypes: float64(2), int64(5), object(5)
memory usage: 42.5+ KB

In [76]:
#2 Number of pasengers
num_passengers = df['PassengerId'].count()
print(num_passengers)

418

In [73]:
#2 Number of male passengers
males = df[df['Sex'] == 'male']
males['PassengerId'].count()

# 2 
num_males = len(df.loc[df["Sex"]=="male"])
print(num_males)

266

In [57]:
#3 Avarage age of passangers
mean = df['Age'].mean()
print(mean)

30.272590361445783

In [78]:
#4 How many people survived
num_survived = len(df.loc[df["Survived"]==1])
print(num_survived)

152

In [92]:
#5 How many male survived

# Doesn't work!
male_survived = len((df['Survived']==1)&(df['Sex']=='male'))
print(male_survived)

418

In [99]:
df.groupby('Sex').count()

,PassengerId,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
Sex,,,,,,,,,,,
female,152,152,152,127,152,152,152,152,44,152,152
male,266,266,266,205,266,266,266,265,47,266,266

In [104]:
df.groupby(['Sex', 'Survived'] )['Survived'].count()

Sex     Survived
female  1           152
male    0           266
Name: Survived, dtype: int64

In [109]:
df.groupby(['Sex']).count()

,PassengerId,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
Sex,,,,,,,,,,,
female,152,152,152,127,152,152,152,152,44,152,152
male,266,266,266,205,266,266,266,265,47,266,266

In [111]:
df['Sex'].value_counts()

male      266
female    152
Name: Sex, dtype: int64

In [113]:
df[df["Survived"]==1].count()

PassengerId    152
Pclass         152
Name           152
Sex            152
Age            127
SibSp          152
Parch          152
Ticket         152
Fare           152
Cabin           44
Embarked       152
Survived       152
dtype: int64

In [118]:
table = pd.crosstab(df['Survived'],df['Sex'])
print (table)

Sex       female  male
Survived
0              0   266
1            152     0